# **************************************************************************** #
# DIRECTORIES
SRC_DIR			:= sources/
INC_DIR			:= includes/
OBJ_DIR			:= obj/
LIBFT_DIR		:= ./libft
MLX_DIR			:= ./MLX42
MLX_BUILD		:= $(MLX_DIR)/build

LIBFT_INC_DIR	:= $(LIBFT_DIR)/include/

# **************************************************************************** #
# PROJECT
NAME		:= cub3D
LIBFT		:= $(LIBFT_DIR)/libft.a
MLX_LIB		:= $(MLX_BUILD)/libmlx42.a

# **************************************************************************** #
# FILES
SRCS_FILES =	test.c \

SRCS	:= $(addprefix $(SRC_DIR), $(SRCS_FILES))
OBJS	:= $(addprefix $(OBJ_DIR), $(SRCS_FILES:.c=.o))
DEPS	:= $(OBJS:.o=.d)

# **************************************************************************** #
# COMPILER
CC		:= cc
CFLAGS	:= -Wall -Wextra -Werror -MMD -MP -g
IFLAGS	:= -I$(INC_DIR) -I$(LIBFT_INC_DIR) -I$(MLX_DIR)/include
LDFLAGS	:= $(LIBFT) $(MLX_LIB) -ldl -lglfw -pthread -lm

# **************************************************************************** #
# COLORES BONITOS
BR	= \033[1;31m
BG	= \033[1;32m
BB	= \033[1;34m
BY	= \033[1;33m
BW	= \033[1;37m
NC	= \033[0;39m
CL	= \033[2K

# **************************************************************************** #
# BUILD OPTIONS
-include $(DEPS)

# Default rule
all: libmlx libft $(NAME)

# **************************************************************************** #
# COMPILAR BIBLIOTECAS
libft:
	@echo "$(BB)[LIBFT]$(NC) Compilando..."
	@$(MAKE) -C $(LIBFT_DIR) > /dev/null

libmlx:
	@if [ ! -d "$(MLX_BUILD)" ]; then \
		echo "$(BB)[MLX42]$(NC) Creando build..."; \
		cmake -S $(MLX_DIR) -B $(MLX_BUILD) > /dev/null; \
	fi
	@cmake --build $(MLX_BUILD) -j4 > /dev/null
	@echo "$(BG)[MLX42] Compilada con éxito ✅$(NC)"

# **************************************************************************** #
# COMPILAR PROYECTO
$(NAME): $(OBJS) $(LIBFT)
	@$(CC) $(CFLAGS) $(OBJS) $(LDFLAGS) -o $(NAME)
	@printf "%b" "$(CL) -> $(BW)[$(NAME)]:\t$(BG)Compilación exitosa ✅$(NC)\n"
	@echo "─────────────────────────────────────────────────────$(BY)"
	@echo " ░▒▓██████▓▒░ ▒▓█▓▒  ▒▓█▓▒ ▒▓███████▓▒ ▒▓███████▓▒░ ▒▓███████▓▒░  "
	@echo "░▒▓█▓▒░░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓███████▓▒ ▒▓███████▓▒  ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo " ░▒▓██████▓▒░ ░▒▓██████▓▒░ ▒▓███████▓▒ ▒▓███████▓▒░ ▒▓███████▓▒░  "                                                                                                                   
	@echo "                by aamaya-g and vlorenzo 💪"
	@echo "$(NC)─────────────────────────────────────────────────────"

# **************************************************************************** #
# COMPILAR OBJETOS
$(OBJ_DIR):
	@mkdir -p $(OBJ_DIR)

$(OBJ_DIR)%.o: $(SRC_DIR)%.c | $(OBJ_DIR)
	@mkdir -p $(dir $@)
	@printf "%b" "$(CL) -> $(BW)[$(NAME)]:\t$(NC)$<\r"
	@$(CC) $(CFLAGS) $(IFLAGS) -c $< -o $@

# **************************************************************************** #
# LIMPIEZA
clean:
	@$(MAKE) -sC $(LIBFT_DIR) clean
	@rm -rf $(OBJ_DIR)
	@printf "%b" "$(CL) -> $(BW)[$(NAME)]:\t$(BG)Objetos limpiados ❎$(NC)\n"

fclean:
	@$(MAKE) -sC $(LIBFT_DIR) fclean
	@rm -rf $(NAME) $(OBJ_DIR) $(MLX_BUILD)
	@printf "%b" "$(CL) -> $(BW)[$(NAME)]:\t$(BG)Proyecto limpiado 🧹$(NC)\n"

re: fclean all

# **************************************************************************** #
.PHONY: all clean fclean re libmlx libft
.DEFAULT_GOAL := all
