# **************************************************************************** #
#                                   PROJECT                                    #
# **************************************************************************** #

NAME        := cub3D

# **************************************************************************** #
#                                   DIRECTORIES                                #
# **************************************************************************** #

SRC_DIR     := sources
OBJ_DIR     := obj

INC_DIR     := includes
LIBFT_DIR   := libft
MLX_DIR     := MLX42
MLX_BUILD   := $(MLX_DIR)/build

LIBFT       := $(LIBFT_DIR)/libft.a
MLX_LIB     := $(MLX_BUILD)/libmlx42.a

# **************************************************************************** #
#                                   FILES                                      #
# **************************************************************************** #

SRCS = \
	main.c \
	parser_init.c \
	parse_file.c \
	parse_color.c \
	load_map_parser.c \
	check_utils.c \
	read_file_to_array.c \
	hook.c \
	raycast.c \
	dup_map.c \
	free_parser.c \
	data_to_game.c

# Compila test.c solo si TEST=1
ifeq ($(TEST),1)
	SRCS_USE := $(SRCS)
else
	SRCS_USE := $(filter-out test.c,$(SRCS))
endif

OBJS = $(addprefix $(OBJ_DIR)/,$(SRCS_USE:.c=.o))
DEPS = $(OBJS:.o=.d)

# **************************************************************************** #
#                                  COMPILER FLAGS                              #
# **************************************************************************** #

CC      := cc
CFLAGS  := -Wall -Wextra -Werror -MMD -MP -g
IFLAGS  := -I$(INC_DIR) -I$(LIBFT_DIR)/include -I$(MLX_DIR)/include
LDFLAGS := $(LIBFT) $(MLX_LIB) -ldl -lglfw -pthread -lm

# **************************************************************************** #
#                                   RULES                                      #
# **************************************************************************** #

all: libmlx libft $(NAME)

$(NAME): $(OBJS) $(LIBFT)
	@$(CC) $(CFLAGS) $(OBJS) $(LDFLAGS) -o $(NAME)
	@printf "%b" "$(CL) -> $(BW)[$(NAME)]:\t$(BG)Compilación exitosa ✅$(NC)\n"
	@echo "─────────────────────────────────────────────────────$(BY)"
	@echo " ░▒▓██████▓▒░ ▒▓█▓▒  ▒▓█▓▒ ▒▓███████▓▒ ▒▓███████▓▒░ ▒▓███████▓▒░  "
	@echo "░▒▓█▓▒░░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓███████▓▒ ▒▓███████▓▒  ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░       ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo "░▒▓█▓▒░░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒      ░▒▓█▓▒ ▒▓█▓▒  ▒▓█▓▒░ "
	@echo " ░▒▓██████▓▒░ ░▒▓██████▓▒░ ▒▓███████▓▒ ▒▓███████▓▒░ ▒▓███████▓▒░  "
	@echo "                by aamaya-g and vlorenzo 💪"
	@echo "$(NC)─────────────────────────────────────────────────────"

$(OBJ_DIR):
	mkdir -p $(OBJ_DIR)

$(OBJ_DIR)/%.o: $(SRC_DIR)/%.c | $(OBJ_DIR)
	$(CC) $(CFLAGS) $(IFLAGS) -c $< -o $@

# **************************************************************************** #
#                                   LIBRARIES                                  #
# **************************************************************************** #

libft:
	@$(MAKE) -C $(LIBFT_DIR)

libmlx:
	@if [ ! -d "$(MLX_BUILD)" ]; then \
		cmake -S $(MLX_DIR) -B $(MLX_BUILD); \
	fi
	@cmake --build $(MLX_BUILD) -j4
	@echo "\033[1;34mMLX42 OK ✔\033[0m"

# **************************************************************************** #
#                                   CLEANING                                   #
# **************************************************************************** #

clean:
	@$(MAKE) -C $(LIBFT_DIR) clean
	rm -rf $(OBJ_DIR)
	rm -rf $(MLX_BUILD)
	@echo "\033[1;33mAll cleaned\033[0m"

fclean: clean
	rm -f $(NAME)
	@$(MAKE) -C $(LIBFT_DIR) fclean

re: fclean all

# **************************************************************************** #
#                                 DEPENDENCIES                                 #
# **************************************************************************** #

-include $(DEPS)

.PHONY: all clean fclean re libft libmlx
